test/benchmark-plain-text-http-GET.txt
This benchmark is generated by Apache Bench(ab)
$ ab -n 1000 -c 10 http://127.0.0.1:8766

Total Number of requests: 1000
Total concurrent requests: 10

Benchmark results: 

Server Software:
Server Hostname:        127.0.0.1
Server Port:            8766

Document Path:          /
Document Length:        129 bytes

Concurrency Level:      10
Time taken for tests:   0.425 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      193000 bytes
HTML transferred:       129000 bytes
Requests per second:    2353.18 [#/sec] (mean)
Time per request:       4.250 [ms] (mean)
Time per request:       0.425 [ms] (mean, across all concurrent requests)
Transfer rate:          443.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  14.5      0     325
Processing:     0    3  27.0      1     325
Waiting:        0    2  22.9      1     325
Total:          0    4  30.7      1     326

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      2
  99%      2
 100%    326 (longest request)