test/benchmark-plain-text-http-GET.txt
This benchmark is generated by Apache Bench(ab)

SERVER CPU INFO:
Architecture:                    x86_64
CPU op-mode(s):                  32-bit, 64-bit
Byte Order:                      Little Endian
Address sizes:                   40 bits physical, 48 bits virtual
CPU(s):                          1
On-line CPU(s) list:             0
Thread(s) per core:              1
Core(s) per socket:              1
Socket(s):                       1
NUMA node(s):                    1
Vendor ID:                       GenuineIntel
CPU family:                      6
Model:                           79
Model name:                      Intel(R) Xeon(R) CPU E5-2650 v4 @ 2.20GHz
Stepping:                        1
CPU MHz:                         2199.998
BogoMIPS:                        4399.99
Virtualization:                  VT-x
Hypervisor vendor:               KVM
Virtualization type:             full
L1d cache:                       32 KiB
L1i cache:                       32 KiB
L2 cache:                        4 MiB
NUMA node0 CPU(s):               0

Tested on Server of RAM: 981 MB
Server Location: Berlin, DE

(Server is located at the other end of the world)

$ ab -c 20 -n 10000 http://REMOTE_IP:8766/

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking REMOTE-IP (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        REMOTE-IP
Server Port:            8766

Document Path:          /
Document Length:        22643 bytes

Concurrency Level:      20
Time taken for tests:   38.346 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      227090000 bytes
HTML transferred:       226430000 bytes
Requests per second:    260.78 [#/sec] (mean)
Time per request:       76.692 [ms] (mean)
Time per request:       3.835 [ms] (mean, across all concurrent requests)
Transfer rate:          5783.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        8   28  16.5     26     299
Processing:    17   48  20.2     45     365
Waiting:        7   25  15.5     23     332
Total:         38   76  28.2     71     536

Percentage of the requests served within a certain time (ms)
  50%     71
  66%     77
  75%     81
  80%     84
  90%     94
  95%    110
  98%    155
  99%    234
 100%    536 (longest request)