test/benchmark-plain-text-http-POST-JSON-CALLBACK.txt
This benchmark is generated by Apache Bench(ab)
$ ab -p post_json.txt -H 'Content-Type: application/json' -c 20 -n 10000 http://127.0.0.1:8766/poster

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        127.0.0.1
Server Port:            8766

Document Path:          /poster
Document Length:        35 bytes

Concurrency Level:      20
Time taken for tests:   0.646 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1050000 bytes
Total body sent:        2090000
HTML transferred:       350000 bytes
Requests per second:    15488.41 [#/sec] (mean)
Time per request:       1.291 [ms] (mean)
Time per request:       0.065 [ms] (mean, across all concurrent requests)
Transfer rate:          1588.17 [Kbytes/sec] received
                        3161.21 kb/s sent
                        4749.38 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     0    0   0.2      0       2
Waiting:        0    0   0.2      0       2
Total:          0    1   0.3      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      2
  99%      2
 100%      4 (longest request)