test/benchmark-plain-text-http-POST-JSON-CALLBACK.txt
This benchmark is generated by Apache Bench(ab)

SERVER CPU INFO:
Architecture:                    x86_64
CPU op-mode(s):                  32-bit, 64-bit
Byte Order:                      Little Endian
Address sizes:                   40 bits physical, 48 bits virtual
CPU(s):                          1
On-line CPU(s) list:             0
Thread(s) per core:              1
Core(s) per socket:              1
Socket(s):                       1
NUMA node(s):                    1
Vendor ID:                       GenuineIntel
CPU family:                      6
Model:                           79
Model name:                      Intel(R) Xeon(R) CPU E5-2650 v4 @ 2.20GHz
Stepping:                        1
CPU MHz:                         2199.998
BogoMIPS:                        4399.99
Virtualization:                  VT-x
Hypervisor vendor:               KVM
Virtualization type:             full
L1d cache:                       32 KiB
L1i cache:                       32 KiB
L2 cache:                        4 MiB
NUMA node0 CPU(s):               0

Tested on Server of RAM: 981 MB
Server Location: Berlin, DE

(Server is located at the other end of the world)

$ ab -p post_json.txt -H 'Content-Type: application/json' -c 20 -n 10000 http://REMOTE_IP:8766/poster

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking REMOTE-IP (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        REMOTE-IP
Server Port:            8766

Document Path:          /poster
Document Length:        201 bytes

Concurrency Level:      20
Time taken for tests:   21.134 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2720000 bytes
Total body sent:        3820000
HTML transferred:       2010000 bytes
Requests per second:    473.18 [#/sec] (mean)
Time per request:       42.267 [ms] (mean)
Time per request:       2.113 [ms] (mean, across all concurrent requests)
Transfer rate:          125.69 [Kbytes/sec] received
                        176.52 kb/s sent
                        302.21 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   23   7.0     22     122
Processing:     5   19   5.5     19      86
Waiting:        5   19   5.5     19      85
Total:         19   42   9.3     41     144

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     44
  75%     46
  80%     48
  90%     52
  95%     56
  98%     63
  99%     69
 100%    144 (longest request)